benchmark/results/qwen_gcp_small_spike.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scenarios/spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 25 max VUs, 51s max duration (incl. graceful stop):
              * default: Up to 25 looping VUs for 21s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 01/25 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 01/25 VUs  01.0s/21.0s

running (02.0s), 01/25 VUs, 1 complete and 0 interrupted iterations
default   [  10% ] 01/25 VUs  02.0s/21.0s

running (03.0s), 12/25 VUs, 2 complete and 0 interrupted iterations
default   [  14% ] 12/25 VUs  03.0s/21.0s

running (04.0s), 24/25 VUs, 3 complete and 0 interrupted iterations
default   [  19% ] 24/25 VUs  04.0s/21.0s

running (05.0s), 25/25 VUs, 4 complete and 0 interrupted iterations
default   [  24% ] 25/25 VUs  05.0s/21.0s

running (06.0s), 25/25 VUs, 5 complete and 0 interrupted iterations
default   [  29% ] 25/25 VUs  06.0s/21.0s

running (07.0s), 25/25 VUs, 6 complete and 0 interrupted iterations
default   [  33% ] 25/25 VUs  07.0s/21.0s

running (08.0s), 25/25 VUs, 8 complete and 0 interrupted iterations
default   [  38% ] 25/25 VUs  08.0s/21.0s

running (09.0s), 25/25 VUs, 9 complete and 0 interrupted iterations
default   [  43% ] 25/25 VUs  09.0s/21.0s

running (10.0s), 25/25 VUs, 9 complete and 0 interrupted iterations
default   [  48% ] 25/25 VUs  10.0s/21.0s

running (11.0s), 25/25 VUs, 9 complete and 0 interrupted iterations
default   [  52% ] 25/25 VUs  11.0s/21.0s

running (12.0s), 25/25 VUs, 11 complete and 0 interrupted iterations
default   [  57% ] 25/25 VUs  12.0s/21.0s

running (13.0s), 25/25 VUs, 12 complete and 0 interrupted iterations
default   [  62% ] 25/25 VUs  13.0s/21.0s

running (14.0s), 25/25 VUs, 12 complete and 0 interrupted iterations
default   [  67% ] 25/25 VUs  14.0s/21.0s

running (15.0s), 25/25 VUs, 13 complete and 0 interrupted iterations
default   [  71% ] 25/25 VUs  15.0s/21.0s

running (16.0s), 25/25 VUs, 14 complete and 0 interrupted iterations
default   [  76% ] 25/25 VUs  16.0s/21.0s

running (17.0s), 25/25 VUs, 15 complete and 0 interrupted iterations
default   [  81% ] 25/25 VUs  17.0s/21.0s

running (18.0s), 25/25 VUs, 16 complete and 0 interrupted iterations
default   [  86% ] 25/25 VUs  18.0s/21.0s

running (19.0s), 25/25 VUs, 18 complete and 0 interrupted iterations
default   [  90% ] 25/25 VUs  19.0s/21.0s

running (20.0s), 25/25 VUs, 19 complete and 0 interrupted iterations
default   [  95% ] 25/25 VUs  20.0s/21.0s

running (21.0s), 24/25 VUs, 20 complete and 0 interrupted iterations
default   [ 100% ] 24/25 VUs  21.0s/21.0s

running (22.0s), 23/25 VUs, 21 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (23.0s), 22/25 VUs, 22 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (24.0s), 21/25 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (25.0s), 21/25 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (26.0s), 21/25 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (27.0s), 20/25 VUs, 24 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (28.0s), 19/25 VUs, 25 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (29.0s), 18/25 VUs, 26 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (30.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (31.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (32.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (33.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (34.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (35.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (36.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (37.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (38.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (39.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (40.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (41.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (42.0s), 17/25 VUs, 27 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s

running (43.0s), 11/25 VUs, 33 complete and 0 interrupted iterations
default ↓ [ 100% ] 24/25 VUs  21s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=19.27s min=518.11ms med=10.29s max=40.07s p(90)=39.48s p(95)=39.73s
      { expected_response:true }...: avg=7.37s  min=518.11ms med=8.33s  max=11.93s p(90)=10.53s p(95)=11.18s
    http_req_failed................: 38.63% 17 out of 44
    http_reqs......................: 44     1.016778/s

    EXECUTION
    iteration_duration.............: avg=19.5s  min=718.77ms med=10.49s max=40.31s p(90)=39.72s p(95)=39.96s
    iterations.....................: 44     1.016778/s
    vus............................: 11     min=1        max=25
    vus_max........................: 25     min=25       max=25

    NETWORK
    data_received..................: 133 kB 3.1 kB/s
    data_sent......................: 53 kB  1.2 kB/s



running (43.3s), 00/25 VUs, 44 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/25 VUs  21s